# 10 Minutes to pandas

## Object Creation

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

### Series


One-dimensional ndarray with axis labels (including time series).

Labels need not be unique but must be a hashable type. The object supports both integer- and label-based indexing and provides a host of methods for performing operations involving the index. Statistical methods from ndarray have been overridden to automatically exclude missing data (currently represented as NaN).

Operations between Series (+, -, /, , *) align values based on their associated index values– they need not be the same length. The result index will be the sorted union of the two indexes.

In [2]:
s = pd.Series([1,3,5,np.nan, 6, 8])

s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

### Creating DataFrame

In [3]:
dates = pd.date_range('20130101', periods=6)

dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

df

                   A         B         C         D
2013-01-01  1.042157  0.722910  0.413165 -0.886905
2013-01-02 -0.321492  0.347237  1.234255 -0.292991
2013-01-03  0.396447  0.246774 -0.456209 -0.309907
2013-01-04 -0.301189  0.621399 -0.263555 -0.860327
2013-01-05 -1.091168  0.859212  1.707109 -0.086611
2013-01-06 -0.340058 -1.128634 -0.469593 -1.029454

In [5]:
df2 = pd.DataFrame({
                        'A' : 1,
                        'B' : pd.Timestamp('20130102'),
                        'C' : pd.Series(1, index = list(range(4)), dtype='float32'),
                        'D' : np.array([3] * 4, dtype= 'int32'),
                        'E' : pd.Categorical(["test", "train", "test", "train"]),
                        'F' : 'foo'
})

df2

   A          B    C  D      E    F
0  1 2013-01-02  1.0  3   test  foo
1  1 2013-01-02  1.0  3  train  foo
2  1 2013-01-02  1.0  3   test  foo
3  1 2013-01-02  1.0  3  train  foo

In [6]:
df2.dtypes

A             int64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [7]:
#df2.<TAB>

## Viewing Data

In [8]:
df.head()

                   A         B         C         D
2013-01-01  1.042157  0.722910  0.413165 -0.886905
2013-01-02 -0.321492  0.347237  1.234255 -0.292991
2013-01-03  0.396447  0.246774 -0.456209 -0.309907
2013-01-04 -0.301189  0.621399 -0.263555 -0.860327
2013-01-05 -1.091168  0.859212  1.707109 -0.086611

In [9]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [11]:
df.values

array([[ 1.04215665,  0.72291034,  0.41316464, -0.88690454],
       [-0.32149238,  0.34723658,  1.2342551 , -0.29299074],
       [ 0.3964468 ,  0.2467738 , -0.45620922, -0.30990663],
       [-0.30118926,  0.6213994 , -0.26355496, -0.86032715],
       [-1.09116834,  0.85921169,  1.70710863, -0.08661121],
       [-0.34005804, -1.12863392, -0.46959335, -1.02945449]])

In [12]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.102551  0.278150  0.360862 -0.577699
std    0.732191  0.726369  0.930063  0.393321
min   -1.091168 -1.128634 -0.469593 -1.029454
25%   -0.335417  0.271889 -0.408046 -0.880260
50%   -0.311341  0.484318  0.074805 -0.585117
75%    0.222038  0.697533  1.028982 -0.297220
max    1.042157  0.859212  1.707109 -0.086611

In [13]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    1.042157   -0.321492    0.396447   -0.301189   -1.091168   -0.340058
B    0.722910    0.347237    0.246774    0.621399    0.859212   -1.128634
C    0.413165    1.234255   -0.456209   -0.263555    1.707109   -0.469593
D   -0.886905   -0.292991   -0.309907   -0.860327   -0.086611   -1.029454

In [14]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.886905  0.413165  0.722910  1.042157
2013-01-02 -0.292991  1.234255  0.347237 -0.321492
2013-01-03 -0.309907 -0.456209  0.246774  0.396447
2013-01-04 -0.860327 -0.263555  0.621399 -0.301189
2013-01-05 -0.086611  1.707109  0.859212 -1.091168
2013-01-06 -1.029454 -0.469593 -1.128634 -0.340058

In [15]:
df.sort_values(by = 'B')

                   A         B         C         D
2013-01-06 -0.340058 -1.128634 -0.469593 -1.029454
2013-01-03  0.396447  0.246774 -0.456209 -0.309907
2013-01-02 -0.321492  0.347237  1.234255 -0.292991
2013-01-04 -0.301189  0.621399 -0.263555 -0.860327
2013-01-01  1.042157  0.722910  0.413165 -0.886905
2013-01-05 -1.091168  0.859212  1.707109 -0.086611

## Selection

Note While standard Python / Numpy expressions for selecting and setting are intuitive and come in handy for interactive work, for production code, we recommend the optimized pandas data access methods, .at, .iat, .loc and .iloc.

### Getting

In [16]:
df['A'] # Selecting a single column, which yields a Series, equivalent to df.A:

2013-01-01    1.042157
2013-01-02   -0.321492
2013-01-03    0.396447
2013-01-04   -0.301189
2013-01-05   -1.091168
2013-01-06   -0.340058
Freq: D, Name: A, dtype: float64

In [17]:
df[0:3] # Selecting via [], which slices the rows.

                   A         B         C         D
2013-01-01  1.042157  0.722910  0.413165 -0.886905
2013-01-02 -0.321492  0.347237  1.234255 -0.292991
2013-01-03  0.396447  0.246774 -0.456209 -0.309907

In [18]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -0.321492  0.347237  1.234255 -0.292991
2013-01-03  0.396447  0.246774 -0.456209 -0.309907
2013-01-04 -0.301189  0.621399 -0.263555 -0.860327

### Selection by Label

In [19]:
df.loc[dates[0]] # For getting a cross section using a label:

A    1.042157
B    0.722910
C    0.413165
D   -0.886905
Name: 2013-01-01 00:00:00, dtype: float64

In [20]:
df.loc[:, ['A','B']] # Selecting on a multi-axis by label:

                   A         B
2013-01-01  1.042157  0.722910
2013-01-02 -0.321492  0.347237
2013-01-03  0.396447  0.246774
2013-01-04 -0.301189  0.621399
2013-01-05 -1.091168  0.859212
2013-01-06 -0.340058 -1.128634

In [21]:
df.loc['20130102':'20130104',['A','B']] # Showing label slicing, both endpoints are included:

                   A         B
2013-01-02 -0.321492  0.347237
2013-01-03  0.396447  0.246774
2013-01-04 -0.301189  0.621399

In [22]:
df.loc['20130102',['A','B']] # Reduction in the dimensions of the returned object:

A   -0.321492
B    0.347237
Name: 2013-01-02 00:00:00, dtype: float64

In [23]:
df.loc[dates[0],'A'] # For getting a scalar value:

1.0421566456400593

In [24]:
df.at[dates[0],'A'] # For getting fast access to a scalar (equivalent to the prior method):

1.0421566456400593

### Selection by Position

In [25]:
df.iloc[3] # Select via the position of the passed integers:

A   -0.301189
B    0.621399
C   -0.263555
D   -0.860327
Name: 2013-01-04 00:00:00, dtype: float64

In [26]:
df.iloc[3:5, 0:2] # By integer slices, acting similar to numpy/python:

                   A         B
2013-01-04 -0.301189  0.621399
2013-01-05 -1.091168  0.859212

In [27]:
df.iloc[[1,2,4,],[0,2]] # By lists of integer position locations, similar to the numpy/python style:

                   A         C
2013-01-02 -0.321492  1.234255
2013-01-03  0.396447 -0.456209
2013-01-05 -1.091168  1.707109

In [28]:
df.iloc[1:3,:] # For slicing rows explicitly:

                   A         B         C         D
2013-01-02 -0.321492  0.347237  1.234255 -0.292991
2013-01-03  0.396447  0.246774 -0.456209 -0.309907

In [29]:
df.iloc[:, 1:3] # For slicing columns explicitly:

                   B         C
2013-01-01  0.722910  0.413165
2013-01-02  0.347237  1.234255
2013-01-03  0.246774 -0.456209
2013-01-04  0.621399 -0.263555
2013-01-05  0.859212  1.707109
2013-01-06 -1.128634 -0.469593

In [30]:
df.iloc[1,1] # For getting a value explicitly:

0.3472365797319461

In [31]:
df.iat[1,1] # For getting fast access to a scalar (equivalent to the prior method):

0.3472365797319461

### Boolean Indexing

In [32]:
df[df.A > 0] # Using a single column’s values to select data.

                   A         B         C         D
2013-01-01  1.042157  0.722910  0.413165 -0.886905
2013-01-03  0.396447  0.246774 -0.456209 -0.309907

In [33]:
df[df > 0] # Selecting values from a DataFrame where a boolean condition is met.

                   A         B         C   D
2013-01-01  1.042157  0.722910  0.413165 NaN
2013-01-02       NaN  0.347237  1.234255 NaN
2013-01-03  0.396447  0.246774       NaN NaN
2013-01-04       NaN  0.621399       NaN NaN
2013-01-05       NaN  0.859212  1.707109 NaN
2013-01-06       NaN       NaN       NaN NaN

In [35]:
df2 = df.copy() # Using the isin() method for filtering:
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  0.396447  0.246774 -0.456209 -0.309907   two
2013-01-05 -1.091168  0.859212  1.707109 -0.086611  four

### Setting

In [38]:
# Setting a new column automatically aligns the data by the indexes.
s1 = pd.Series([1,2,3,4,5,6,], index=pd.date_range('20130102', periods = 6)) 
s1

df['F'] = s1

In [39]:
df.at[dates[0],'A'] = 0 # Setting values by label:

In [40]:
df.iat[0,1] = 0 # Setting values by position:

In [41]:
 df.loc[:, 'D'] = np.array([5] * len(df))

In [42]:
df # The result of the prior setting operations.

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.413165  5  NaN
2013-01-02 -0.321492  0.347237  1.234255  5  1.0
2013-01-03  0.396447  0.246774 -0.456209  5  2.0
2013-01-04 -0.301189  0.621399 -0.263555  5  3.0
2013-01-05 -1.091168  0.859212  1.707109  5  4.0
2013-01-06 -0.340058 -1.128634 -0.469593  5  5.0

In [44]:
df2 = df.copy() # A where operation with setting.
df2[df2>0] = -df2
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.413165 -5  NaN
2013-01-02 -0.321492 -0.347237 -1.234255 -5 -1.0
2013-01-03 -0.396447 -0.246774 -0.456209 -5 -2.0
2013-01-04 -0.301189 -0.621399 -0.263555 -5 -3.0
2013-01-05 -1.091168 -0.859212 -1.707109 -5 -4.0
2013-01-06 -0.340058 -1.128634 -0.469593 -5 -5.0

## Missing Data

In [47]:
# A where operation with setting.
df1 = df.reindex(index = dates[0:4], columns = list(df.columns)+ ['E'])

df1

                   A         B         C  D    F   E
2013-01-01  0.000000  0.000000  0.413165  5  NaN NaN
2013-01-02 -0.321492  0.347237  1.234255  5  1.0 NaN
2013-01-03  0.396447  0.246774 -0.456209  5  2.0 NaN
2013-01-04 -0.301189  0.621399 -0.263555  5  3.0 NaN

In [49]:
# To drop any rows that have missing data.
df1.dropna(how='any')

Empty DataFrame
Columns: [A, B, C, D, F, E]
Index: []

In [50]:
# Filling missing data.
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.413165  5  5.0  5.0
2013-01-02 -0.321492  0.347237  1.234255  5  1.0  5.0
2013-01-03  0.396447  0.246774 -0.456209  5  2.0  5.0
2013-01-04 -0.301189  0.621399 -0.263555  5  3.0  5.0

In [51]:
# To get the boolean mask where values are nan.
pd.isna(df1)

                A      B      C      D      F     E
2013-01-01  False  False  False  False   True  True
2013-01-02  False  False  False  False  False  True
2013-01-03  False  False  False  False  False  True
2013-01-04  False  False  False  False  False  True